victorzhengg/nrf5_sdk_17_1_0/examples/ble_central_and_peripheral/ble_app_mns/main.c
    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    ret_code_t           err_code;

    err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for starting advertising.
 */
/*
static void advertising_stop(void)
{
    ret_code_t           err_code;

    err_code = sd_ble_gap_adv_stop(m_adv_handle);
    APP_ERROR_CHECK(err_code);
}
*/


/**@brief Function for handling the Connected event.
 *
 * @param[in] p_gap_evt GAP event received from the BLE stack.
 */
static void peripheral_on_connected(const ble_gap_evt_t * const p_gap_evt)
{
    uint32_t m_periph_link_cnt = 0;
		mns_node_t node;
		uint32_t error;

    m_periph_link_cnt = ble_conn_state_peripheral_conn_count(); // Number of peripheral links.
	
		NRF_LOG_INFO("role peripheral was connected. address:");
		NRF_LOG_HEXDUMP_INFO(p_gap_evt->params.connected.peer_addr.addr, 6);	
		NRF_LOG_INFO("connect handle = 0x%x. total connection = %d", p_gap_evt->conn_handle, m_periph_link_cnt);
						
		memset(&node, 0, sizeof(mns_node_t));
		node.conn_handle = p_gap_evt->conn_handle;
	  memcpy(&(node.peer_addr), 
	         &(p_gap_evt->params.connected.peer_addr), 
	         sizeof(ble_gap_addr_t));
	
	  error = mns_control_add_node(&m_mns_control, &node);
	  if(error != 0)
		{
				NRF_LOG_INFO("fail to add node to mns");
		}
	
    switch (m_periph_link_cnt)
		{
        case 1:
						m_conn_handle[0] = p_gap_evt->conn_handle;
						bsp_board_led_on(GATT_SERVER_LED_1);
						bsp_board_led_off(GATT_SERVER_LED_2);
						advertising_start();
            break;
				
        case 2: /*NRF_SDH_BLE_PERIPHERAL_LINK_COUNT*/
						m_conn_handle[1] = p_gap_evt->conn_handle;
						bsp_board_led_on(GATT_SERVER_LED_1);
						bsp_board_led_on(GATT_SERVER_LED_2);
            break;
				
        default:
            // No implementation needed.
            break;			
		}
}


/**@brief Function for handling the Disconnected event.
 *
 * @param[in] p_gap_evt GAP event received from the BLE stack.
 */
static void peripheral_on_disconnected(ble_gap_evt_t const * const p_gap_evt)
{
		uint32_t m_periph_link_cnt = 0;
	
    m_periph_link_cnt = ble_conn_state_peripheral_conn_count(); // Number of peripheral links.

		NRF_LOG_INFO("peripheral Connection 0x%x has been disconnected. Reason: 0x%X, total:%d",
                 p_gap_evt->conn_handle,
                 p_gap_evt->params.disconnected.reason,
								 m_periph_link_cnt);

		mns_control_delete_node(&m_mns_control, p_gap_evt->conn_handle);
	
    switch (m_periph_link_cnt)
		{
        case 0:
						m_conn_handle[0] = BLE_CONN_HANDLE_INVALID;
						m_conn_handle[1] = BLE_CONN_HANDLE_INVALID;
						bsp_board_led_off(GATT_SERVER_LED_1);
						bsp_board_led_off(GATT_SERVER_LED_2);				
            break;
				
        case 1:
						if(p_gap_evt->conn_handle == m_conn_handle[0])
						{
								m_conn_handle[0] = m_conn_handle[1];
								m_conn_handle[1] = BLE_CONN_HANDLE_INVALID;
						}
						else if(p_gap_evt->conn_handle == m_conn_handle[1])
						{
								m_conn_handle[1] = BLE_CONN_HANDLE_INVALID;
						}
						bsp_board_led_on(GATT_SERVER_LED_1);
						bsp_board_led_off(GATT_SERVER_LED_2);
						advertising_start();
            break;				
				
        default:
            // No implementation needed.
            break;			
		}	
}

static void scan_start(void)
{
    ret_code_t err_code;

    err_code = nrf_ble_scan_start(&m_scan);
    APP_ERROR_CHECK(err_code);
}

static void central_ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    ret_code_t err_code;

    // For readability.
    ble_gap_evt_t const * p_gap_evt = &p_ble_evt->evt.gap_evt;

    switch (p_ble_evt->header.evt_id)
    {
        // Upon connection, check which peripheral has connected (HR or RSC), initiate DB
        // discovery, update LEDs status and resume scanning if necessary. */
        case BLE_GAP_EVT_CONNECTED:
        {
						NRF_LOG_INFO("central_ble_evt_handler: Connected. address:");
						NRF_LOG_HEXDUMP_INFO(p_gap_evt->params.connected.peer_addr.addr, 6);
						NRF_LOG_INFO("central_ble_evt_handler: Connected. handle:%d", p_gap_evt->conn_handle);
					
            err_code = ble_mnss_c_handles_assign(&m_ble_mnss_c, p_gap_evt->conn_handle, NULL);
            APP_ERROR_CHECK(err_code);

            err_code = ble_db_discovery_start(&m_db_disc, p_gap_evt->conn_handle);
            APP_ERROR_CHECK(err_code);

						mns_node_t node;
	  
						memset(&node, 0, sizeof(mns_node_t));
						node.conn_handle = p_gap_evt->conn_handle;
						memcpy(&(node.peer_addr), 
									 &(p_gap_evt->params.connected.peer_addr), 
									 sizeof(ble_gap_addr_t));
						node.central_flag = 1;
						err_code = mns_control_add_node(&m_mns_control, &node);
						if(err_code != 0)
						{
								NRF_LOG_INFO("fail to add node to mns");
						}
						
            // Update LEDs status, and check if we should be looking for more
            // peripherals to connect to.
            bsp_board_led_on(GATT_CLIENT_LED);
        } break;

        // Upon disconnection, reset the connection handle of the peer which disconnected, update
        // the LEDs status and start scanning again.
        case BLE_GAP_EVT_DISCONNECTED:
        {
						NRF_LOG_INFO("central_ble_evt_handler: Disconnected.");
					
						mns_control_delete_node(&m_mns_control, p_gap_evt->conn_handle);
					
						bsp_board_led_off(GATT_CLIENT_LED);
					
            scan_start();
        } break;

        case BLE_GAP_EVT_TIMEOUT:
        {
            // We have not specified a timeout for scanning, so only connection attemps can timeout.
            if (p_gap_evt->params.timeout.src == BLE_GAP_TIMEOUT_SRC_CONN)
            {
                NRF_LOG_DEBUG("central_ble_evt_handler: Connection request timed out.");
            }
        } break;

        case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:
        {
            // Accept parameters requested by peer.
            err_code = sd_ble_gap_conn_param_update(p_gap_evt->conn_handle,
                                        &p_gap_evt->params.conn_param_update_request.conn_params);
            APP_ERROR_CHECK(err_code);
        } break;

