victorzhengg/nrf5_sdk_17_1_0/examples/ble_central_and_peripheral/ble_app_mns/main.c
/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
    ret_code_t err_code;

    //The array must be static because a pointer to it will be saved in the button handler module.
    static app_button_cfg_t buttons[] =
    {
        {BSP_BUTTON_0, false, BUTTON_PULL, button_event_handler},
				{BSP_BUTTON_1, false, BUTTON_PULL, button_event_handler},
				{BSP_BUTTON_2, false, BUTTON_PULL, button_event_handler},
				{BSP_BUTTON_3, false, BUTTON_PULL, button_event_handler}
    };

    err_code = app_button_init(buttons, ARRAY_SIZE(buttons),
                               BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);
}


static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}

static void led_delay_timer_handler(void * p_context)
{
		bsp_board_led_off(MNSS_LED);
}

static void disconnect_delay_timer_handler(void * p_context)
{
		if(m_mns_control.disc_ongoing == 1)
		{
				m_mns_control.disc_ongoing = 0;
				NRF_LOG_INFO("Disconnect process finished");
		}			
}

static void mns_timer_handler(void * p_context)
{	
	  uint32_t ret;
	
		if(sync_enable_flag == 1)
		{
				mns_control_synchronize_with_node(&m_mns_control);
		}
		
		m_mns_control.local_data.cnt++;
		
		if((m_mns_control.local_data.cnt % m_mns_control.local_data.period) == 0)
		{
				bsp_board_led_on(MNSS_LED);
				app_timer_start(m_led_delay_timer, LED_ON_DELAY, NULL);
		}

		mns_control_communicate_with_node(&m_mns_control);
		
		ret = mns_control_redundant_connection_handle(&m_mns_control);
		if(ret != 0) /* disconnect process is ongoing*/
		{
				app_timer_start(m_disconnect_delay_timer, MNS_DISCONNECT_DELAY, NULL);	
		}
}

/*
static void nrf_ble_scan_connect_with_target(nrf_ble_scan_t           const * const p_scan_ctx,
                                             ble_gap_evt_adv_report_t const * const p_adv_report)
{
    ret_code_t err_code;
    scan_evt_t scan_evt;

    // For readability.
    ble_gap_addr_t const        * p_addr        = &p_adv_report->peer_addr;
    ble_gap_scan_params_t const * p_scan_params = &p_scan_ctx->scan_params;
    ble_gap_conn_params_t const * p_conn_params = &p_scan_ctx->conn_params;
    uint8_t                       con_cfg_tag   = p_scan_ctx->conn_cfg_tag;

    // Return if the automatic connection is disabled.
    if (!p_scan_ctx->connect_if_match)
    {
        return;
    }

    // Stop scanning.
    nrf_ble_scan_stop();

    memset(&scan_evt, 0, sizeof(scan_evt));

    // Establish connection.
    err_code = sd_ble_gap_connect(p_addr,
                                  p_scan_params,
                                  p_conn_params,
                                  con_cfg_tag);

    NRF_LOG_DEBUG("Connecting");

    scan_evt.scan_evt_id                    = NRF_BLE_SCAN_EVT_CONNECTING_ERROR;
    scan_evt.params.connecting_err.err_code = err_code;

    NRF_LOG_DEBUG("Connection status: %d", err_code);

    // If an error occurred, send an event to the event handler.
    if ((err_code != NRF_SUCCESS) && (p_scan_ctx->evt_handler != NULL))
    {
        p_scan_ctx->evt_handler(&scan_evt);
    }

}
*/



/**@brief Function for handling Scaning events.
 *
 * @param[in]   p_scan_evt   Scanning event.
 */
static void scan_evt_handler(scan_evt_t const * p_scan_evt)
{
    ret_code_t err_code;
		const ble_gap_evt_adv_report_t *p_adv_report;

    switch(p_scan_evt->scan_evt_id)
    {
			case NRF_BLE_SCAN_EVT_FILTER_MATCH:
						p_adv_report = p_scan_evt->params.filter_match.p_adv_report;
			      
						if(mns_control_if_node_connected(&m_mns_control, &(p_adv_report->peer_addr)) == MNS_INVALID_INDEX)
						{
								NRF_LOG_INFO("add new node:");
								NRF_LOG_HEXDUMP_INFO(p_adv_report->peer_addr.addr, 6);
								nrf_ble_scan_stop();
								err_code = sd_ble_gap_connect((ble_gap_addr_t const *)&(p_adv_report->peer_addr),
																							&m_scan.scan_params,
																							&m_scan.conn_params,
																							m_scan.conn_cfg_tag);							
						}
			
					break;
			
			case NRF_BLE_SCAN_EVT_CONNECTING_ERROR:
            err_code = p_scan_evt->params.connecting_err.err_code;
            APP_ERROR_CHECK(err_code);
            break;
        default:
          break;
    }
}

static void scan_init(void)
{
    ret_code_t          err_code;
    nrf_ble_scan_init_t init_scan;

    memset(&init_scan, 0, sizeof(init_scan));

    init_scan.connect_if_match = false;
    init_scan.conn_cfg_tag     = APP_BLE_CONN_CFG_TAG;

    err_code = nrf_ble_scan_init(&m_scan, &init_scan, scan_evt_handler);
    APP_ERROR_CHECK(err_code);

    // Setting filters for scanning.
    err_code = nrf_ble_scan_filters_enable(&m_scan, NRF_BLE_SCAN_NAME_FILTER, false);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_scan_filter_set(&m_scan, SCAN_NAME_FILTER, m_target_periph_name);
    APP_ERROR_CHECK(err_code);	
}


/**@brief Function for handling database discovery events.
 *
 * @details This function is callback function to handle events from the database discovery module.
 *          Depending on the UUIDs that are discovered, this function should forward the events
 *          to their respective services.
 *
 * @param[in] p_event  Pointer to the database discovery event.
 */
static void db_disc_handler(ble_db_discovery_evt_t * p_evt)
{
    ble_mnss_on_db_disc_evt(&m_ble_mnss_c, p_evt);
}


static void db_discovery_init(void)
{
    ble_db_discovery_init_t db_init;

    memset(&db_init, 0, sizeof(db_init));

    db_init.evt_handler  = db_disc_handler;
    db_init.p_gatt_queue = &m_ble_gatt_queue;

    ret_code_t err_code = ble_db_discovery_init(&db_init);
    APP_ERROR_CHECK(err_code);	
}




/**@brief Handles events coming from the LED Button central module.
 */
static void mnss_c_evt_handler(ble_mnss_c_t * p_mnss_c, ble_mnss_c_evt_t * p_mnss_c_evt)
{
    switch (p_mnss_c_evt->evt_type)
    {
        case BLE_MNSS_C_EVT_DISCOVERY_COMPLETE:
        {
            ret_code_t err_code;

            err_code = ble_mnss_c_handles_assign(&m_ble_mnss_c,
                                                p_mnss_c_evt->conn_handle,
                                                &p_mnss_c_evt->params.peer_db);
						APP_ERROR_CHECK(err_code);
					
						NRF_LOG_INFO("mnss_c_evt_handler: BLE_LBS_C_EVT_DISCOVERY_COMPLETE");
        } break; // BLE_LBS_C_EVT_DISCOVERY_COMPLETE

        case BLE_MNSS_C_EVT_WRITE:
        {
            NRF_LOG_INFO("BLE_MNSS_C_EVT_WRITE.");
 
        } break; // BLE_LBS_C_EVT_BUTTON_NOTIFICATION

				case BLE_MNSS_C_EVT_READ:
        {
						mns_control_udpate_node(&m_mns_control, 
																		p_mnss_c_evt->conn_handle, 
																		&(p_mnss_c_evt->params.data));
 
        } break; // BLE_LBS_C_EVT_BUTTON_NOTIFICATION
				
        default:
            // No implementation needed.
            break;
    }
}

/**@brief Function for handling the LED Button Service client errors.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void mnss_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    ret_code_t         err_code;
    ble_mnss_init_t    init     = {0};
    nrf_ble_qwr_init_t qwr_init = {0};

