victorzhengg/nrf5_sdk_17_1_0/examples/ble_central_and_peripheral/ble_app_mns/main.c
    // Initialize Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);

    // Initialize LBS.
    init.data_write_handler = mnss_write_handler;

		
		/*peripheral service initial*/
    err_code = ble_mnss_init(&m_mnss, &init);
    APP_ERROR_CHECK(err_code);
		
		
		/*central service initial*/
    ble_mnss_c_init_t mnss_c_init_obj;

    mnss_c_init_obj.evt_handler   = mnss_c_evt_handler;
    mnss_c_init_obj.p_gatt_queue  = &m_ble_gatt_queue;
    mnss_c_init_obj.error_handler = mnss_error_handler;

    err_code = ble_mnss_c_init(&m_ble_mnss_c, &mnss_c_init_obj);
    APP_ERROR_CHECK(err_code);
}



/**@brief Function for application main entry.
 */
int main(void)
{
		uint32_t err_code;
    // Initialize.
    log_init();
    leds_init();
	  
		
		
	
    timers_init();
		app_timer_create(&m_mns_timer, APP_TIMER_MODE_REPEATED, mns_timer_handler);
	  app_timer_create(&m_led_delay_timer, APP_TIMER_MODE_SINGLE_SHOT, led_delay_timer_handler);
		app_timer_create(&m_disconnect_delay_timer, APP_TIMER_MODE_SINGLE_SHOT, disconnect_delay_timer_handler);
	
	
		app_timer_start(m_mns_timer, MNS_TIMER_PERIOD, NULL);
	
    buttons_init();
		err_code = app_button_enable();
		APP_ERROR_CHECK(err_code);
	
    power_management_init();
	
		mns_control_init(&m_mns_control, &m_mnss, &m_ble_mnss_c);												
															
    ble_stack_init();
		scan_init();
    gap_params_init();
    gatt_init();
		db_discovery_init();
		
    services_init();
    advertising_init();
    conn_params_init();
		
    

    // Start execution.
    
		scan_start();
    advertising_start();
		
		NRF_LOG_INFO("Multi Node Synchronize example started. SN: %X", m_mns_control.local_data.sn);
    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


/**
 * @}
 */
